Repository: quick-lint/quick-lint-js
Catalog: po/*.po
Languages: de, fr_fr, pt_br, sv_se

source: upper case letters compared with toLowerCase
de: Großbuchstaben werden mit toLowerCase verglichen
pt_br: letras maiúsculas comparadas com toLowerCase

source: using '{0}' against an array literal does not compare items
pt_br: usar '{0}' com uma array não compara os itens

source: using '{0}' against an arrow function always returns '{1}'
pt_br: usar '{0}' com uma arrow function sempre retorna '{1}'

source: using '{0}' against a class literal always returns '{1}'
pt_br: usar '{0}' com uma classe sempre retorna '{1}'

source: '{0} []' is always '{1}'
pt_br: '{0} []' é sempre '{1}'

source: using '{0}' against an object literal always returns '{1}'
pt_br: usar '{0}' com um objeto sempre retorna '{1}'

source: using '{0}' against a regular expression literal always returns '{1}'
pt_br: usar '{0}' com uma expressão regular sempre retorna '{1}'

source: something happened
de: etwas geschah
pt_br: algo aconteceu

source: see here
de: siehe hier
pt_br: veja aqui

source: this {0} looks fishy
de: dieses {0} sieht merkwürdig aus
pt_br: isso {0} parece suspeito

source: this {1} looks fishy
de: dieses {1} sieht merkwürdig aus
pt_br: isso {1} parece suspeito

source: expected {1:headlinese}
de: {1:headlinese} erwartet
pt_br: esperado {1:headlinese}

source: expected {1:singular}
de: {1:singular} erwartet
pt_br: esperado {1:singular}

source: here
de: hier
pt_br: aqui

source: React/JSX is not yet implemented
de: React/JSX ist noch nicht implementiert
fr_fr: React/JSX n'est pas encore implémenté

source: free {1} and {0} {1} {2}
de: freies {1} und {0} {1} {2}

source: what is this '{1}' nonsense?
de: Was soll dieser '{1}' Humbug?

source: TypeScript's 'enum' feature is not yet implemented by quick-lint-js
fr_fr: la fonctionnalité 'enum' de TypeScript n'est pas encore implémentée dans quick-lint-js
sv_se: TypeScripts 'enum' är inte ännu implementerad av quick-lint-js
