Repository: quick-lint/quick-lint-js
Catalog: po/*.po
Languages: de, fr_fr, pt_br, sv_se

source: variable assigned before its declaration
de: Zuweisung an Variable vor Deklaration
fr_fr: variable affectée avant sa déclaration
pt_br: variável atribuída antes de ser declarada
sv_se: tilldelar variabel före deklaration

source: variable declared here
de: Variablendeklaration ist hier
fr_fr: variable déclarée ici
pt_br: variável declarada aqui
sv_se: variabel deklarerades här

source: ~~~ invalid string, do not use outside benchmark ~~~
pt_br: ~~~ string inválida, não use fora de benchmarks ~~~

source: another invalid string, do not use outside benchmark
pt_br: outra string inválida, não use fora de benchmarks

source: 'do-while' loop
de: do-while-Schleife
pt_br: loop 'do-while'

source: 'for' loop
de: for-Schleife
pt_br: loop 'for'

source: 'if' statement
de: if-Anweisung
pt_br: instrução 'if'

source: 'while' loop
de: while-Schleife
pt_br: loop 'while'

source: 'with' statement
de: with-Anweisung
pt_br: instrução 'with'

source: labelled statement
pt_br: instrução com label

source: a 'do-while' loop
de: eine do-While-Schleife
pt_br: um loop 'do-while'

source: a 'for' loop
de: eine for-Schleife
pt_br: um loop 'for'

source: an 'if' statement
de: eine if-Anweisung
pt_br: uma instrução 'if'

source: a 'while' loop
de: eine while-Schleife
pt_br: um loop 'while'

source: a 'with' statement
de: eine with-Anweisung
pt_br: uma instrução 'with'

source: a labelled statement
pt_br: uma instrução com label

source: abstract fields cannot have default values
pt_br: campos abstratos não podem ter valores padrões

source: field marked abstract here
pt_br: campo marcado como abstrato aqui

source: abstract methods cannot be marked 'async'
pt_br: métodos abstratos não podem ser marcados como 'async'

source: abstract methods cannot be marked as a generator
pt_br: métodos abstratos não podem ser marcados como generators

source: abstract properties are not allowed in interfaces
pt_br: propriedades abstratas não são permitidas em interfaces

source: abstract properties are only allowed in abstract classes
pt_br: propriedades abstratas só são permitidas em classes abstratas

source: class is not marked abstract
pt_br: classe não é marcada como abstrata

source: abstract methods cannot contain a body
pt_br: métodos abstratos não podem ter conteúdo

source: missing '<>' and '</>' to enclose multiple children
de: '<>' und '</>' fehlt, um mehrere Children einzuschließen
pt_br: falta '<>' e '</>' para fechar os múltiplos nós

source: children end here
de: Children enden hier
pt_br: os nós acabam aqui

source: missing parentheses around parameter
pt_br: faltam os parênteses ao redor do parâmetro

source: TypeScript type annotation requires parentheses
pt_br: anotações de tipagem de TypeScript requerem parênteses

source: '=' changes variables; to compare, use '===' instead
de: '=' verändert Variable. Für Vergleich '===' anstattdessen verwenden
pt_br: '=' altera variáveis; para comparar, use '==='

source: assignment to const global variable
de: Zuweisung an globale konstante Variable
fr_fr: affectation à une variable globale constante
pt_br: atribuição para variável global constante
sv_se: tilldelar till global konstant variabel

source: assignment to const variable
de: Zuweisung an konstante Variable
fr_fr: affectation à une variable constante
pt_br: atribuição para variável constante
sv_se: tilldelar till konstant variabel

source: const variable declared here
de: Konstante Variable wurde hier deklariert
fr_fr: variable constante déclarée ici
pt_br: variável constante declarada aqui
sv_se: konstant variabel deklarerad här

source: assignment to imported variable
de: Zuweisung an importierte Variable
pt_br: atribuição para variável importada

source: imported variable declared here
de: Importierte Variable wurde hier deklariert
pt_br: variável importada declarada aqui

source: assignment to const variable before its declaration
de: Zuweisung an konstante Variable vor Deklaration
fr_fr: affectation à une variable constante avant sa déclaration
pt_br: atribuição para variável constante antes da declaração
sv_se: tilldelar konstant variable före dens deklaration

source: assignment to undeclared variable
de: Zuweisung an nicht deklarierte Variable
fr_fr: affectation à une variable non déclarée
pt_br: atribuição para variável não declarada
sv_se: tilldelar värde till variabel före deklaration

source: 'await' is only allowed in async functions
de: 'await' darf nur in mit 'asysc' markierten Funktionen verwendet werden
fr_fr: 'await' n'est autorisé que dans des fonctions async
pt_br: 'await' só é permitido em funções async
sv_se: 'await' är enbart tillåtet i en 'async' funktion

source: 'await' cannot be followed by an arrow function; use 'async' instead
de: 'await' kann nicht von einer Arrow-Funktion gefolgt werden. 'async' anstattdessen verwenden.
fr_fr: 'await' ne peut être suivi d'une fonction fléchée ; utiliser plutôt 'async'
pt_br: 'await' não pode ser procedido por uma arrow function; use 'async'

source: 'async static' is not allowed; write 'static async' instead
de: 'async static' ist ungültig. 'static asysc' anstattdessen verwenden.
fr_fr: 'async static' n'est pas autorisé ; utiliser plutôt 'static async'
pt_br: 'async static' não é permitido; use 'static async'

source: BigInt literal contains decimal point
de: BigInt-Literal mit Dezimalpunkt
fr_fr: le litéral BigInt contient un séparateur de décimales
pt_br: valor BigInt contém casa decimal
sv_se: BigInt heltallitterär innehåller decimaler

source: BigInt literal contains exponent
de: BigInt-Literal mit Exponenten
fr_fr: le litéral BigInt contient un exposant
pt_br: valor BigInt contém expoente
sv_se: BigInt heltallitterär innehåller exponent

source: C-style for loop is missing its third component
de: C-ähnliche for-Schleife fehlt drittes Argument
fr_fr: troisième argument manquant pour la boucle de style C
pt_br: falta o terceiro componente do for
sv_se: C-stil 'for' loop saknar tredje komponentent

source: cannot assign to loop variable in for of/in loop
de: Ungültige Zuweisung an Iterationsvariable der for-in/of-Schleife
fr_fr: impossible d'affecter la variable de boucle dans une boucle for of/in
pt_br: não é possível atribuir para variável do loop em um loop for of/in

source: cannot access private identifier outside class
de: Zugriff auf privaten Bezeichner außerhalb der Klasse
fr_fr: impossible d'accéder à un identifiant privé en dehors d'une classe
pt_br: não é possível acessar identificador privado fora da classe

source: assigning to 'async' in a for-of loop requires parentheses
de: Zuweisung an 'async' in einer for-of-Schleife erfordert Verwendung von Klammern
fr_fr: une affectation de type 'async' dans une boucle for-of nécessite l'usage de parenthèses
pt_br: atribuir para 'async' em um loop for-of requer parênteses
sv_se: tilldelning av 'async' i for-of loop kräver paranteser

source: cannot declare 'await' inside async function
de: Kann 'await' nicht innerhalb einer async-Funktion deklarieren
fr_fr: impossible de déclarer 'await' à l'intérieur d'une fonction async
pt_br: não é possível declarar 'await' dentro de uma função async
sv_se: kan inte deklarera 'await' inuti async funktion

source: classes cannot be named 'let'
de: Klassen dürfen nicht mit 'let' benannt werden
fr_fr: une classe ne peut être nommée 'let'
pt_br: classes não podem se chamar 'let'
sv_se: klass kan inte benämnas 'let'

source: let statement cannot declare variables named 'let'
de: let darf keine Variablen namens 'let' deklarieren
fr_fr: une instruction let ne peut déclarer de variables nommées 'let'
pt_br: instrução let não pode declarar uma variável chamada 'let'
sv_se: let påstående kan inte deklareras med namnet 'let'

source: cannot declare variable named keyword '{0}'
de: Kann keine Variable namens 'let' exportieren
fr_fr: impossible de déclarer une variable nommée comme le mot-clé '{0}'
pt_br: não é possível declarar uma variável com o nome '{0}'
sv_se: kan inte deklarera variabel med nyckelord '{0}'

source: cannot declare 'yield' inside generator function
de: Kann 'yield' nicht innerhalb einer Generatorfunktion deklarieren
fr_fr: impossible de déclarer 'yield' à l'intérieur d'une fonction génératrice
pt_br: não é possível declarar 'yield' dentro de uma função generator
sv_se: kan inte deklarera 'yield' inuti en generatorfunktion

source: cannot declare and export variable with 'export default'
de: Kann keine Variable namens 'let' deklarieren und exportieren
fr_fr: impossible de déclarer et d'exporter une variable avec 'export default'
pt_br: não é possível declarar e exportar variável com 'export default'
sv_se: kan inte deklarera och exportera variabel med 'export default'

source: cannot export variable named 'let'
de: Kann keine Variable namens 'let' exportieren
fr_fr: impossible d'exporter une variable nommée 'let'
pt_br: não é possível exportar variável chamada 'let'
sv_se: kan inte exportera variabel vid namn 'let'

source: cannot export variable named keyword '{0}'
de: Ungültiger Export einer Variablen mit dem Namen des Schlüsselwortes '{0}'
fr_fr: impossible d'exporter une variable nommée comme le mot-clé '{0}'
pt_br: não é possível exportar variável com o nome '{0}'
sv_se: kan inte exportera variabel med nyckelord '{0}'

source: cannot import 'let'
de: 'let' kann nicht importiert werden
fr_fr: impossible d'importer 'let'
pt_br: não é possível importar 'let'
sv_se: kan inte importera 'let'

source: cannot import variable named keyword '{0}'
de: Kann keine Variable namens 'let' exportieren
fr_fr: impossible d'importer une variable nommée comme un mot-clé '{0}'
pt_br: não é possível importar variável com o nome '{0}'
sv_se: kan inte importera variabel med namngivet nyckelord '{0}'

source: missing quotes around module name '{0}'
pt_br: faltam aspas em volta do nome do módulo '{0}'

source: cannot reference private variables without object; use 'this.'
de: Private Felder des Objekts können nicht ohne 'this.' referenziert werden
fr_fr: impossible de référencer des variables privées sans objet ; utiliser 'this.'
pt_br: não é possível referenciar variáveis privadas sem objeto; use 'this'.
sv_se: kan inte referera en privat variabel utan ett objekt; använd 'this'

source: cannot update variable with '{0}' while declaring it
de: An Variable '{0}' kann nicht während der Deklaration zugewiesen werden
fr_fr: impossible d'actualiser la variable avec '{0}' pendant sa déclaration
pt_br: não é possível atualizar variável com '{0}' enquanto a declara
sv_se: kan inte uppdatera variabel med '{0} under deklaration'

source: remove '{0}' to update an existing variable
de: Entferne '{0}' um die vorhandene Variable zu updaten
fr_fr: supprimer '{0}' pour actualiser une variable existante
pt_br: remova '{0}' para atualizar uma variável já existente
sv_se: ta bort '{0}' för att uppdatera en existerande variabel

source: unexpected 'catch' without 'try'
de: Unerwartetes 'catch' ohne zugehöriges 'try'
fr_fr: instruction 'catch' inattendue en l'absence de 'try'
pt_br: 'catch' inesperado sem um 'try'
sv_se: oförväntad 'catch' utan någon 'try'

source: missing body for {1:headlinese}
de: Körper für {1:headlinese} fehlt
fr_fr: corps manquant pour {1:headlinese}
pt_br: falta conteúdo para {1:headlinese}
sv_se: saknas stycke för {1:headlinese}

source: a class statement is not allowed as the body of {1:singular}
de: Ein Klassen-Statement darf nicht der Körper von {1:singular} sein
fr_fr: une déclaration de classe n'est pas autorisée dans le corps de {1:singular}
pt_br: uma declaração de classe não é permitida como o conteúdo de {1:singular}
sv_se: klass sats är inte tillåtet som ett stycke av {1:singular}

source: character is not allowed in identifiers
de: Ungültiges Zeichen in Bezeichner
fr_fr: caractère non autorisé dans les identifiants
pt_br: caracter não é permitido em identificadores
sv_se: tecknet är inte tillåtet i indentifierare

source: commas are not allowed after spread parameter
de: Ungültiges Komma nach Spread-Parameter
fr_fr: les virgules ne sont pas autorisées après un paramètre d'expansion
pt_br: vírgulas não são permitidas após parâmetro com spread
sv_se: kommatecken är inte tillåtet efter sprid parameter

source: leading commas are not allowed in generic parameter lists
pt_br: vírgulas no início não são permitidas em listas de parâmetros genéricos

source: commas are not allowed between class methods
de: Kommata sind nicht erlaubt zwischen Methoden einer Klasse
fr_fr: les virgules ne sont pas autorisées entre les méthodes de classe
pt_br: vírgulas não são permitidas entre métodos de uma classe

source: JSON syntax error
de: Syntaxfehler in JSON
fr_fr: erreur de syntaxe JSON
pt_br: erro de sintaxe de JSON

source: "global-groups" entries must be strings
de: Einträge in "global-groups" müssen Strings sein
fr_fr: les entrées de type "global-groups" doivent être des chaînes de caractères
pt_br: entradas em "global-groups" precisam ser strings

source: "global-groups" must be a boolean or an array
de: "global-groups" muss entweder ein Boolean oder ein Array sein
fr_fr: "global-groups" doit être un booléen ou un tableau
pt_br: "global-groups" precisa ser uma boolean ou uma array

source: "globals" descriptor must be a boolean or an object
de: Der "globals"-Deskriptor muss entweder ein Boolean oder ein Array sein
fr_fr: le descripteur "globals" doit être un booléen ou un objet
pt_br: entrada em "globals" precisa ser uma boolean ou um objeto

source: "globals" descriptor "shadowable" property must be a boolean
de: Die "shadowable"-Eigenschaft des "globals"-Deskriptor muss ein Boolean sein
fr_fr: pour le descripteur "globals" la propriété "shadowable" doit êre un booléen
pt_br: entrada "shadowable" em "globals" precisa ser uma boolean

source: "globals" descriptor "writable" property must be a boolean
de: Die "writable"-Eigenschaft des "globals"-Deskriptor muss ein Boolean sein
fr_fr: pour le descripteur "globals" la propriété "writable" doit être un booléen
pt_br: entrada "writable" em "globals" precisa ser uma boolean

source: "globals" must be an object
de: "globles" muss ein Objekt sein
fr_fr: "globals" doit être un objet
pt_br: "globals" precisa ser um objeto

source: depth limit exceeded
de: Maximale Verschachtelungstiefe überschritten
fr_fr: limite de profondeur dépassée
pt_br: limite de profundidade excedido
sv_se: djup begränsning överskriden

source: '.' is not allowed after generic arguments; write ["{1}"] instead
pt_br: '.' não é permitido após argumentos genéricos; use ["{1}"]

source: missing property name between '.' and '.'
de: Eigenschaftsname fehlt zwischen '.' und '.'
fr_fr: nom de propriété manquante entre '.' et '.'
pt_br: falta o nome da propriedade entre '.' e '.'

source: 'else' has no corresponding 'if'
de: 'else' ohne zugehöriges 'if'
fr_fr: 'else' n'a pas de 'if' correspondant
pt_br: 'else' não tem um 'if' correspondente
sv_se: 'else' har ingen anhörig 'if'

source: missing comparison; '{1}' does not extend to the right side of '{0}'
de: Vergleich fehlt. '{1}' wird nicht auf der rechten Seite von '{0}' angewandt
pt_br: falta a comparação; '{1}' não se extende até o lado direito do '{0}'

source: '{0}' found here
de: '{0}' ist hier
pt_br: '{0}' encontrado aqui

source: escaped character is not allowed in identifiers
de: Escape-Zeichen darf nicht nicht in Bezeichnern verwendet werden
fr_fr: caractère échappé non permis dans les identifiants
pt_br: caracter escapado não é permiido em identificadores
sv_se: flykttecken är inte tillåtet i indentifierare

source: code point out of range
de: Codepunkt außerhalb des zulässigen Bereichs
fr_fr: point de code hors limite
pt_br: code point fora do intervalo permitido
sv_se: kod punkt ur span

source: code point in Unicode escape sequence must not be greater than U+10FFFF
de: Codepunkt innerhalb der Unicode-Escapesequenz darf nicht größer als U+10FFFF sein
fr_fr: un point de code dans une séquence d'échappement Unicode ne peut dépasser la valeur U+10FFFF
pt_br: code point em sequências de escape Unicode não pode ser maior que U+10FFFF

source: escaping '-' is not allowed in tag names; write '-' instead
de: Escape von '-' ist in Tagnamen nicht erlaubt. '-' anstattdessen schreiben
pt_br: escapar '-' não é permitido em nomes de tags; use '-'

source: extra ',' is not allowed between function call arguments
de: Mehrere Kommata zwischen den Argumenten eines Funktionsaufruf sind ungültig
fr_fr: ',' supplémentaire non autorisé entre les arguments d'appel d'une fonction
pt_br: ',' extra nẽo é permitida entre argumentos de uma chamada de função
sv_se: extra ',' är inte tillåtet mellan funktionkallelses argument

source: extra ',' is not allowed between enum members
pt_br: ',' extra não é permitido entre membros de um enum

source: expected 'as' between '{1}' and '{2}'
de: 'as' zwischen '{1}' und '{2}' erwartet
fr_fr: 'as' attendu entre '{1}' and '{2}'
pt_br: 'as' esperado entre '{1}' e '{2}'
sv_se: förväntade 'as' mellan '{1}' och '{2}'

source: expected ',' between object literal entries
de: Komma fehlt zwischen Feldern des Objekt-Literals
fr_fr: ',' attendu entre les entrées littérales d'un objet
pt_br: ',' esperada entre entradas de um objeto
sv_se: förväntade ',' mellan förekommande objektlitteral

source: expected expression before newline
de: Ausdruck vor Zeilenumbruch erwartet
fr_fr: instruction attendue avant le saut de ligne
pt_br: esperada uma expressão antes da quebra de linha
sv_se: förväntade ett uttryck före nyrad

source: expected expression after 'case'
de: Ausdruck nach 'case' erwartet
fr_fr: instruction attendue après 'case'
pt_br: esperada uma expressão após 'case'
sv_se: förväntade ett uttryck efter 'case'

source: expected expression before semicolon
de: Ausdruck vor Semikolon erwartet
fr_fr: instruction attendue avant un point-virgule
pt_br: esperada uma expressão antes do ponto e vírgula
sv_se: förväntade ett uttryck före semikolon

source: expected 'from "name_of_module.mjs"'
de: 'from "name_of_module.mjs"' erwartet
fr_fr: 'from "name_of_module.mjs"' attendu
pt_br: esperado 'from "nome_do_modulo.mjs"'
sv_se: förväntade 'from "name_of_module.mjs"'

source: expected 'from' before module specifier
de: 'from' vor Modulspezifikation erwartet
fr_fr: 'from' attendu avant un spécificateur de module
pt_br: esperado 'from' antes do nome do módulo
sv_se: förväntade 'from' före modulspecifierare

source: expected hexadecimal digits in Unicode escape sequence
de: Hexadezimale Ziffern in Unicode-Escapesequenz erwartet
fr_fr: nombres hexadecimaux attendus dans une séquence d'échappement Unicode
pt_br: dígitos hexadecimais são esperados em uma sequência de escape Unicode
sv_se: förväntade hexadecimala siffror i Unicode flyktsekvens

source: expected '{{'
de: '{{' erwartet
fr_fr: '{{' attendu
pt_br: '{{' esperado
sv_se: förväntade '{{'

source: expected ')' to close function call
de: ')' für Funktionsaufruf fehlt
fr_fr: ')' attendu pour clore un appel de fonction
pt_br: ')' esperado para fechar a chamada de função
sv_se: förväntade ')' för att slutföra funktionkallelse

source: function call started here
de: Funktionsaufruf beginnt hier
fr_fr: appel de fonction débuté ici
pt_br: chamada de função iniciou aqui
sv_se: funktionkallelse startar här

source: do-while loop needs parentheses around condition
de: Klammern um Bedingung der do-while-Schleife fehlen
fr_fr: une boucle do-while nécessite des parenthèses autour de la condition
pt_br: loop do-while precisa de parênteses ao redor da condição
sv_se: do-while loop behöver paranteser runt vilkor

source: do-while loop is missing '{1}' around condition
de: '{1}' fehlt um Bedingung der do-while-Schleife
fr_fr: une boucle do-while nécesite '{1}' autour de la condition
pt_br: falta '{1}' ao redor da condição do loop do-while
sv_se: do-while loop saknar '{1}' runt vilkor

source: if statement needs parentheses around condition
de: Klammern fehlen um Bedingung der if-Anweisung
fr_fr: une instruction if nécessite des parenthèses autour de la condition
pt_br: instrução if requer parênteses ao redor da condição
sv_se: if sats behöver paranteser runt vilkor

source: if statement is missing '{1}' around condition
de: '{1}' fehlt um Bedingung der if-Anweisung
fr_fr: une instruction if nécessite '{1}' autour de la condition
pt_br: falta '{1}' ao redor da condição da instrução if
sv_se: if sats saknar '{1}' runt vilkor

source: switch statement needs parentheses around condition
de: Klammern fehlen um Bedingung der switch-Anweisung
fr_fr: une instruction switch nécessite des parenthèses autour de la condition
pt_br: instrução switch requer parênteses ao redor da condição
sv_se: switch sats behöver paranteser runt vilkor

source: switch statement is missing '{1}' around condition
de: '{1}' fehlt um Bedingung der switch-Anweisung
fr_fr: une instruction switch nécessite '{1}' autour de la condition
pt_br: falta '{1}' ao redor da condição da instrução switch
sv_se: switch sats saknas '{1}' runt vilkoren

source: while loop needs parentheses around condition
de: Klammern fehlen um Bedingung der while-Schleife
fr_fr: une boucle while nécessite des parenthèses autour de la condition
pt_br: loop while requer parênteses ao redor da condição
sv_se: while loop behöver paranteser runt vilkoren

source: while loop is missing '{1}' around condition
de: '{1}' fehlt um Bedingung der while-Schleife
fr_fr: une boucle while nécessite '{1}' autour de la condition
pt_br: falta '{1}' ao redor da condição do loop while
sv_se: while loop saknar '{1}' runt vilkoren

source: with statement needs parentheses around expression
de: Klammern fehlen um Ausdruck der with-Anweisung
fr_fr: une instruction with nécessite des parenthèses autour de l'expression
pt_br: instrução with requer parênteses ao redor da expressão
sv_se: with påstående saknar paranteser runt uttryck

source: with statement is missing '{1}' around expression
de: '{1}' fehlt um Ausdruck der with-Anweisung
fr_fr: une instruction with nécessite '{1}' autour de l'expression
pt_br: falta '{1}' ao redor da expressão da instrução with
sv_se: with påstående saknar '{1}' runt uttryck

source: expected variable name for 'catch'
de: Variablenname für 'catch' fehlt
fr_fr: nom de variable requis pour 'catch'
pt_br: esperado um nome de variável para o 'catch'
sv_se: förväntade variabel namn för 'catch'

source: expected variable name for 'import'-'as'
de: Variablenname für 'import'-'as' fehlt
fr_fr: nom de variable requis pour 'import'-'as'
pt_br: esperado um nome de variável para 'import'-'as'

source: exporting requires 'default'
de: Exportieren erfordert 'default'
fr_fr: l'exportation nécessite 'default'
pt_br: exportar requer 'default'
sv_se: exportering kräver 'default'

source: exporting requires '{{' and '}'
de: Exportieren erfordert '{{' und '}'
fr_fr: l'exportation nécessite '{{' and '}'
pt_br: exportar requer '{{' e '}'
sv_se: exportering kräver '{{' och '}'

source: forwarding exports are only allowed in export-from
de: Forwarding-Exporte sind nur in export-from zulässig
fr_fr: les exports transférés ne sont autorisés qu'avec export-from
pt_br: re-encaminhar exports só é permitido em export-from
sv_se: framförandeexportering är enbart tillåtet i export-from

source: unexpected 'finally' without 'try'
de: 'finally' ohne zugehöriges 'try'
fr_fr: 'finally' inapproprié sans 'try'
pt_br: inesperado 'finally' sem 'try'
sv_se: oförväntad 'finally' utan 'try'

source: a function statement is not allowed as the body of {1:singular}
de: Ein Funktionsstatement ist ungültig als Körper von {1:singular}
fr_fr: une instruction de fonction ne peut faire partie du corps de {1:singular}
pt_br: uma função não é permitida como conteúdo de {1:singular}
sv_se: en funktion sats är inte tillåtet som stycke till {1:singular}
