Repository: quick-lint/quick-lint-js
Catalog: po/*.po
Languages: de, fr_fr, pt_br, sv_se

source: 'readonly static' is not allowed; write 'static readonly' instead
pt_br: 'readonly static' não é permitido; use 'static readonly'

source: redeclaration of global variable
de: Globale Variable wird erneut deklariert
fr_fr: redéclaration de variable globale
pt_br: redeclaração de variável global
sv_se: omdeklaration av global variabel

source: redeclaration of variable: {0}
de: Variable '{0}' wird erneut deklariert
fr_fr: redéclaration de variable: {0}
pt_br: redeclaração de variável: {0}
sv_se: omdekleration av variabel: {0}

source: variable already declared here
de: Variable wurde zuvor hier deklariert
fr_fr: variable déjà déclarée ici
pt_br: variável já foi declarada aqui
sv_se: variabel är redan deklarerad här

source: redundant 'await'
pt_br: 'await' redundante

source: RegExp literal flags cannot contain Unicode escapes
de: RegExp-Literale dürfen keine Unicode Escapes enthalten
fr_fr: un littéral RegExp ne peut contenir des échappements Unicode
pt_br: flags do RegExp não podem conter sequências de escape Unicode

source: return statement returns nothing (undefined)
de: Return-Statement gibt nichts (undefined) zurück
fr_fr: l'instruction de retour ne retourne rien (undefined)
pt_br: instrução de return não retorna nada (undefined)

source: cannot use '...' on 'this' parameter
pt_br: não é possível usar '...' no parâmetro 'this'

source: unexpected statement before first switch case, expected 'case' or 'default'
de: Unerwartetes Statment vor dem ersten Switch-Case. Entweder 'case' oder 'default' erwartet.
pt_br: instrução inesperada antes do primeiro switch case, esperado 'case' ou 'default'

source: stray comma in let statement
de: Vereinzeltes Komma in let-Statement
fr_fr: virgule isolée dans une instruction let
pt_br: vírgula extra em instrução let
sv_se: vilset komma i let påstående

source: stray comma in function parameter
de: Vereinzeltes Komme in Funktionsparameter
fr_fr: virgule isolée dans un paramètre de fonction
pt_br: vírgula extra em parâmetro da função

source: 'this' must be the first parameter
pt_br: 'this' precisa ser o primeiro parâmetro

source: first parameter starts here
pt_br: primeiro parâmetro inicia aqui

source: 'this' parameters are not allowed in arrow functions
pt_br: parâmetro 'this' não é permitido em arrow functions

source: 'this' parameters are not allowed in JavaScript
pt_br: parâmetro 'this' não é permitido em JavaScript

source: 'this' parameter not allowed when destructuring
pt_br: parâmetro 'this' não é permitido ao desestruturar

source: {0} classes are not allowed in JavaScript
pt_br: classe {0} não é permitida em JavaScript

source: TypeScript <Type> type assertions are not allowed in JSX mode
pt_br: asserções de tipo de TypeScript com <Type> não são permitidas em modo JSX

source: write the type assertion with 'as' here instead
pt_br: escreva a asserção de tipo aqui como 'as'

source: 'as const' is only allowed on literals (array, object, string, boolean) and enum members
pt_br: 'as const' só é permitido em valores literais (array, object, string, boolean) e membros de enums

source: 'as const' located here
pt_br: 'as const' localizado aqui

source: TypeScript 'as' type assertions are not allowed in JavaScript
pt_br: asserções de tipo de TypeScript com 'as' não são permitidas em JavaScript

source: use ':' instead of 'as' to type a function parameter
pt_br: use ':' em vez de 'as' para definir o tipo de um parâmetro de uma função

source: assignment-asserted fields are not supported in interfaces
pt_br: campos com asserção de atribuição não são suportados em interfaces

source: TypeScript assignment-asserted fields are not supported in JavaScript
pt_br: campos com asserção de atribuição do TypeScript não são suportados em JavaScript

source: assignment-assertion fields cannot have default values
pt_br: campos com asserção de atribuição não podem ter valores padrões

source: here is the assignment assertion operator
pt_br: aqui está o operador de asserção de atribuição

source: assignment-asserted field must have a type annotation
pt_br: campo com asserção de atribuição precisa ter uma anotação de tipo

source: '{0}' is not allowed on methods
pt_br: '{0}' não é permitido em métodos

source: catch variable can only be typed as '*', 'any', or 'unknown'
pt_br: variável do catch só pode ser tipada como '*', 'any' ou 'unknown'

source: TypeScript 'implements' is not allowed in JavaScript
pt_br: 'implements' não é permitido em JavaScript

source: cannot delete variables in TypeScript
pt_br: não é possível deletar variáveis em TypeScript

source: enum member needs initializer
pt_br: membro do enum precisa de um inicializador

source: computed value disables enum autoincrement
pt_br: valores computados desabilitam a incrementação automática do enum

source: computed enum member name must be a simple string
pt_br: nome do membro do enum computado precisa ser uma string simples

source: TypeScript's 'enum' feature is not allowed in JavaScript
pt_br: 'enum' do TypeScript não é permitido em JavaScript

source: enum member name cannot be numeric
pt_br: nome do membro do enum não pode ser numérico

source: {1:headlinese} value must be a compile-time constant
pt_br: valor {1:headlinese} precisa ser uma constante em tempo de compilação

source: 'extends' must be before 'implements'
pt_br: 'extends' precisa ficar antes do 'implements'

source: move the 'extends' clause before 'implements' here
pt_br: mova a cláusula 'extends' para antes do 'implements' aqui

source: TypeScript import aliases are not allowed in JavaScript
pt_br: apelidos de importação do TypeScript não são permitidos em JavaScript

source: write 'const' instead of '{0}' here
pt_br: use 'const' em vez de '{0}' aqui

source: index signature must be a field, not a method
pt_br: index signature precisa ser um campo, não um método

source: index signatures require a value type
pt_br: index signature precisa de um tipo para o valor

source: function overload signature must be named '{1}'
pt_br: overload de assinatura de função precisa se chamar '{1}'

source: overloaded function '{0}' declared here
pt_br: função overloaded '{0}' declarada aqui

source: function overload signature cannot have generator '*'
pt_br: overload de assinatura de função não pode ter '*'

source: generic arrow function needs ',' here in TSX
pt_br: aqui no TSX, uma arrow function genérica precisa de ','

source: expected at least one parameter in generic parameter list
pt_br: esperado ao menos um parâmetro na lista de parâmetros genéricos

source: TypeScript generics are not allowed in JavaScript code
pt_br: generics do TypeScript não são permitidos em código JavaScript

source: TypeScript type exports are not allowed in JavaScript
pt_br: exportações de tipo do TypeScript não são permitidos em JavaScript

source: 'type' cannot be used twice in export
pt_br: 'type' não pode ser usado duas vezes no export

source: remove this 'type'
pt_br: remova esse 'type'

source: 'type' cannot be used twice in import
pt_br: 'type' não pode ser usado duas vezes na importação

source: interfaces cannot contain static blocks
pt_br: interfaces não podem conter blocos estáticos

source: TypeScript's 'interface' feature is not allowed in JavaScript code
pt_br: 'interface' do TypeScript não é permitido em código JavaScript

source: missing name for element in named tuple type
pt_br: falta o nome para o elemento na named tuple

source: this tuple type is a named tuple type because at least one element has a name
pt_br: essa tupla é uma named tuple porque ao menos um elemento tem um nome

source: TypeScript namespaces are not allowed in JavaScript
pt_br: namespaces do TypeScript não são permitidos em JavaScript

source: TypeScript non-null assertions are not allowed in JavaScript
pt_br: asserções de valores não-nulos do TypeScript não são permitidos em JavaScript

source: TypeScript optional parameters are not allowed in JavaScript
pt_br: parâmetros opcionais do TypeScript não são permitidos em JavaScript

source: TypeScript optional properties are not allowed in JavaScript code
pt_br: propriedades opcionais do TypeScript não são permitidas em código JavaScript

source: 'private' is not allowed in JavaScript
pt_br: 'private' não é permitido em JavaScript

source: 'protected' is not allowed in JavaScript
pt_br: 'protected' não é permitido em JavaScript

source: 'public' is not allowed in JavaScript
pt_br: 'public' não é permitido em JavaScript

source: TypeScript's 'readonly' feature is not allowed in JavaScript code
pt_br: 'readonly' do TypeScript não é permitido em código JavaScript

source: methods cannot be readonly
pt_br: métodos não podem ser readonly

source: 'readonly' only works with array types and tuple types
pt_br: 'readonly' só funciona com arrays e tuplas

source: expected '?' to mark tuple element as optional
pt_br: esperado '?' para marcar o elemento da tupla como opcional

source: only optional tuple elements can follow this optional tuple element
pt_br: apenas elementos opcionais da tupla podem prosseguir esse elemento opcional

source: unexpected ':' in expression; did you mean 'as'?
pt_br: ':' inesperado na expressão; você quis dizer 'as'?

source: TypeScript type annotations are not allowed in JavaScript code
pt_br: anotações de tipo do TypeScript não são permitidas em código JavaScript

source: TypeScript types are not allowed in JavaScript
pt_br: tipos de TypeScript não são permitidos em JavaScript

source: TypeScript type imports cannot import both default and named exports
pt_br: importações de tipos do TypeScript não podem importar exportações default e nomeadas simultaneamente

source: TypeScript type imports are not allowed in JavaScript
pt_br: importações de tipo do TypeScript não são permitidas em JavaScript

source: const fields within classes are only allowed in TypeScript, not JavaScript
de: Innerhalb Klassen sind const-Felder nur in TypeScript gültig, nicht jedoch in JavaScript
fr_fr: les champs const dans des classes ne sont autorisés qu'avec TypeScript, et pas JavaScript
pt_br: campos constantes dentro de classes só são permitidos em TypeScript, não em JavaScript

source: unclosed block comment
de: Blockkommentar ohne Ende
fr_fr: commentaire de bloc non fermé
pt_br: bloco de comentário não encerrado
sv_se: oavslutad kommentationsstycke

source: unclosed class; expected '}' by end of file
de: Klasse ohne Ende. '}' bis spätestens zum Ende der Datei erwartet
pt_br: classe não encerrada; esperado '}'

source: unclosed code block; expected '}' by end of file
de: Code-Block ohne Ende. '}' bis spätestens zum Ende der Datei erwartet
fr_fr: bloc de code non fermé ; '}' attendu avant la fin du fichier
pt_br: bloco de comentário não encerrado; esperado '}'
sv_se: oavslutad kod stycke; förväntade '}' innan slutet av filen

source: unclosed interface; expected '}' by end of file
pt_br: interface não encerrada; esperado '}'

source: unclosed identifier escape sequence
de: Unbeendete Bezeichner-Escapesequenz
fr_fr: séquence d'échappement d'identifiant non fermée
pt_br: sequência de escape não foi fechada
sv_se: oavslutad identifierare flyktsekvens

source: unclosed object literal; expected '}'
de: Unbeendetes Objekt-Literal. '}' erwartet
fr_fr: littéral objet non fermé ; '}' attendu
pt_br: objeto não encerrado; esperado '}'
sv_se: oavslutad objektlitterär; förväntade '}'

source: object literal started here
de: Objektliteral beginnt hier
fr_fr: littéral objet débuté ici
pt_br: objeto iniciou aqui
sv_se: objektlitteral startades här

source: unclosed regexp literal
de: Unbeendetes RegExp-Literal
fr_fr: littéral regexp non fermé
pt_br: regexp não encerrado
sv_se: oavslutad regexplitteral

source: unclosed string literal
de: Zeichenkette ohne Ende
fr_fr: littéral string non fermé
pt_br: string não encerrada
sv_se: oavslutad stränglitteral

source: unclosed template
de: Template ohne Ende
fr_fr: template non fermé
pt_br: template não foi fechado
sv_se: oavslutad mall

source: unexpected '@'
de: Unerwartetes '@'
fr_fr: '@' inattendu
pt_br: '@' inesperado
sv_se: oförväntad '@'

source: unexpected '{0}'
de: Unerwartetes '{0}'
fr_fr: '{0}' inattendu
pt_br: '{0}' inesperado
sv_se: oförväntad '{0}'

source: expected parameter for arrow function, but got an expression instead
de: Unerwarter Ausdruck anstelle des Parameters der Arrow-Funktion
fr_fr: paramètre attendu au lieu d'une expression pour la fonction fléchée
pt_br: esperado um parâmetro para a arrow function, mas em vez disso foi encontrada uma expressão
sv_se: förväntade paramter till pilfunktion, men fick ett uttryck istället

source: expected parameter for arrow function, but got a literal instead
de: Unerwartetes Literal anstelle des Parameters der Arrow-Funktion
fr_fr: paramètre attendu au lieu d'un littéral pour la fonction fléchée
pt_br: esperado um parâmetro para a arrow function, mas em vez disso foi encontrado um valor
sv_se: förväntade parameter för pilfunktion, men fick in litterär istället

source: unexpected '\' in identifier
de: Unerwartetes '\' in Bezeichner
fr_fr: '\' inattendu dans un identifiant
pt_br: '\' inesperado em um identificador
sv_se: oförväntad '\' i identifierare

source: unexpected 'case' outside switch statement
de: Unerwartetes 'case' außerhalb des switch-Statements
fr_fr: 'case' inattendu en dehors d'une instruction switch
pt_br: 'case' inesperado fora de uma instrução switch
sv_se: oförväntad 'case' utanför switch sats

source: unexpected characters in number literal
de: Unerwartete Zeichen in Zahlenliteral
fr_fr: caractères inattendus dans un littéral numérique
pt_br: caracteres inesperados em um número
sv_se: oförväntat tecken i nummerlitteral

source: unexpected control character
de: Unerwartetes Steuerzeichen
fr_fr: caractère de contrôle inattendu
pt_br: caracter de control inesperado
sv_se: oförväntat kontrolltecken

source: unexpected characters in binary literal
de: Unerwartete Zeichen in binärem Zahlenliteral
fr_fr: caractères inattendus dans un littéral binaire
pt_br: caracteres inesperados em um número binário
sv_se: oförväntat tecken i binärlitteral

source: unexpected characters in octal literal
de: Unerwartete Zeichen in oktalem Zahlenliteral
fr_fr: caractères inattendus dans un littéral octal
pt_br: caracteres inesperados em um número octal
sv_se: oförväntat tecken i oktallitteral

source: unexpected characters in hex literal
de: Unerwartete Zeichen in hexadezimalem Zahlenliteral
fr_fr: caractères inattendus dans un littéral hex
pt_br: caracteres inesperados em um número hexadecimal
sv_se: oförväntat tecken i hexlitteral

source: unexpected 'default' outside switch statement
de: Unerwartetes 'default' außerhalb des switch-Statements
fr_fr: 'default' inattendu en dehors d'une instruction switch
pt_br: 'default' inesperado fora de uma instrução switch
sv_se: oförväntad 'default' utanför switch sats

source: '>' is not allowed directly in JSX text; write {{'>'} or &gt; instead
de: '>' darf nicht direkt in JSX-Text verwendet werden. Anstattdessen {{'>} oder &gt; schreiben.
pt_br: '>' não é permitido diretamente em um texto JSX; use {{'>'} ou &gt;

source: unexpected literal in parameter list; expected parameter name
de: Unerwartetes Literal in Parameterliste. Parametername erwartet
fr_fr: littéral inattendu dans une liste de paramètres ; nom de paramètre attendu
pt_br: valor inesperado na lista de parâmetros; esperado o nome de um parâmetro
sv_se: oförväntad litteral i parameter lista; förväntade parameter namn

source: '}' is not allowed directly in JSX text; write {{'}'} instead
de: '}' darf nicht direkt in JSX-Text verwendet werden. Anstattdessen {{'}'} schreiben
pt_br: '}' não é permitido diretamente em um texto JSX; use {{'}'}

source: unexpected '?'
pt_br: '?' inesperado

source: unexpected '?' when destructuring
pt_br: '?' inesperado ao desestruturar

source: C-style for loops have only three semicolon-separated components
de: C-ähnliche for-Schleifen haben nur drei durch Semikolon getrennte Komponenten
fr_fr: les boucles for de style C ne possèdent que trois composantes séparées par des points-virgules
pt_br: loops 'for' no estilo C só devem ter três componentes separados por ponto e vírgula
sv_se: C-stil for loops har enbart tre semikolon separerande komponenter

source: for-in loop expression cannot have semicolons
de: Ausdruck der for-in-Schleife darf keine Semikolon beinhalten
fr_fr: une instruction de boucle for-in ne peut contenir de points-virgules
pt_br: loop for-in não pode ter ponto e vírgula
sv_se: for-in loop satser kan inte ha semikolon

source: for-of loop expression cannot have semicolons
de: Ausdruck der for-in-Schleife darf keine Semikolon beinhalten
fr_fr: une instruction de boucle for-of ne peut contenir de points-virgules
pt_br: loop for-of não pode ter ponto e vírgula
sv_se: for-of loop satser kan inte ha semikolon

source: unopened block comment
de: Blockkommentar ohne Beginn
fr_fr: commentaire de bloc non ouvert
pt_br: bloco de comentário não foi aberto

source: new variable shadows existing variable
de: Neue Variable macht bereits existierende unsichtbar
pt_br: nova variável oculta uma variável existente

source: existing variable declared here
de: Bereits existierende Variable wurde hier deklariert
pt_br: variável existente foi declarada aqui

source: binary number literal has no digits
de: Binäres Zahlenliteral ohne Ziffern
fr_fr: le littéral numérique binaire n'a pas de chiffres
pt_br: número binário não tem dígitos
sv_se: binära nummerlitteraler has inga siffror

source: hex number literal has no digits
de: Hexadezimales Zahlenliteral ohne Ziffern
fr_fr: le littéral numérique hex n'a pas de chiffres
pt_br: número hexadecimal não tem dígitos
sv_se: hex nummerlitteral har inga siffror

source: octal number literal has no digits
de: Oktales Zahlenliteral ohne Ziffern
fr_fr: le littéral numérique octal n'a pas de chiffres
pt_br: número octal não tem dígitos
sv_se: oktal nummerlitteral har inga siffror

source: TypeScript non-null assertion is not allowed on parameters
pt_br: asserções de valores não-nulos do TypeScript não são permitidos em parâmetros

source: unexpected '#'
de: Unerwartete '#'
fr_fr: '#' inattendu
pt_br: '#' inesperado
sv_se: oförväntad '#'

source: unicode byte order mark (BOM) cannot appear before #! at beginning of script
de: Die Unicode Bytereihenfolge-Markierung (BOM) darf nicht vor #! zu Beginn eines Skripts erscheinen
fr_fr: un indicateur d'ordre des octets (BOM) ne peut figurer avant #! au début d'un script
pt_br: unicode byte order mark (BOM) não pode aparecer antes do #! no começo do script
sv_se: unicode byte ordningsmärke (BOM) kan inte förekomma före #! i början av skript

source: unexpected identifier in expression; missing operator before
de: Unerwarteter Bezeichner in Ausdruck. Operator fehlt davor.
fr_fr: identifiant inattendu dans une expression ; opérateur initial manquant
pt_br: identificador inesperado na expressão; falta o operador
sv_se: oförväntad identifierare i uttryck; saknar operatör före

source: unexpected token
de: Unerwartetes Token
fr_fr: symbole manquant
pt_br: token inesperado
sv_se: oförväntad token

source: unexpected token in export; expected 'export default ...' or 'export {{name}' or 'export * from ...' or 'export class' or 'export function' or 'export let'
de: Unerwartetes Token in Export. Möglichkeiten sind: 'export default ...' oder 'export {{name}' oder 'export * from ...' oder 'export class' oder 'export function' oder 'export let'
fr_fr: symbole inattendu dans export ; 'export default ...' ou 'export {{name}' ou 'export * from ...' ou 'export class' ou 'export function' ou 'export let' attendu
pt_br: token inesperado em export; esperado 'export default ...' ou 'export {{nome}' ou 'export * from ...' ou 'export class' ou 'export function' ou 'export let'
sv_se: oförväntad token i export; förväntade 'export default ...' eller 'export {{name}' eller 'export * from ...' eller 'export class' eller 'export function' 'export let'

source: unexpected token in variable declaration; expected variable name
de: Unerwartetes Token innerhalb der Variablendeklaration. Variablenname anstattdessen erwartet
fr_fr: symbole inattendu dans une déclaration de variable ; nom de variable attendu
pt_br: token inesperado em uma declaração de variável; esperado um nome de variável
sv_se: oförväntad token i variabel deklaration; förväntade variabel namn

source: unmatched indexing bracket
de: Zugehörige Indizierungsklammer fehlt
fr_fr: crochet d'indexation non apparié
pt_br: colchete não correspondido
sv_se: omatchad indexerande hakparantes

source: unmatched parenthesis
de: Zugehörige Klammer fehlt
fr_fr: parenthèse non appariée
pt_br: parênteses não correspondidos
sv_se: omatchad parantes

source: unmatched '}'
de: Zugehörige geschweifte Klammer fehlt
fr_fr: '}' non apparié
pt_br: '}' não correspondido
sv_se: omatchad '}'

source: {0} is not the name of a parameter
pt_br: {0} não é o nome de um parâmetro

source: use of undeclared type: {0}
pt_br: uso de tipo não declarado: {0}

source: use of undeclared variable: {0}
de: Variable {0} wird verwendet, ist jedoch nicht deklariert
fr_fr: utilisation d'une variable non déclarée : {0}
pt_br: uso de variável não declarada: {0}
sv_se: användning av odeklarerad variabel: {0}

source: variable used before declaration: {0}
de: Variable '{0}' wird ihrer Deklaration verwendet
fr_fr: variable utilisée avant sa déclaration : {0}
pt_br: variável usada antes de ser declarada: {0}
sv_se: variabel använd före: {0}

source: function called before declaration in block scope: {0}
de: Funktion '{0}' wird im Block-Scope vor ihrer Deklaration aufgerufen
fr_fr: fonction appelée avant sa déclaration dans la portée de bloc : {0}
pt_br: função chamada antes de ser declarada: {0}

source: function declared here
de: Funktion wird hier deklariert
fr_fr: fonction déclarée ici
pt_br: função declarada aqui
sv_se: funktion deklarerad här

source: TypeScript interface fields cannot be initalized
pt_br: campos de interfaces do TypeScript não podem ser inicializados

source: TypeScript interface methods cannot be marked 'async'
pt_br: métodos de interfaces do TypeScript não podem ser marcados como 'async'

source: TypeScript interface methods cannot be marked as a generator
pt_br: métodos de interfaces do TypeScript não podem ser marcados como generators

source: TypeScript interface methods cannot contain a body
pt_br: métodos de interface do TypeScript não podem ter conteúdo

source: interface properties cannot be marked public explicitly
pt_br: propriedades de interfaces não podem ser marcadas como públicas explicitamente

source: interface properties are always public and cannot be private
pt_br: propriedades de interfaces são sempre públicas e não podem ser privadas

source: TypeScript interface properties are always public and cannot be marked protected
pt_br: propriedades de interfaces de TypeScript são sempre públicas e não podem ser marcadas como protected

source: TypeScript interface properties cannot be 'static'
pt_br: propriedades de interfaces do TypeScript não podem ser 'static'

source: break can only be used inside of a loop or switch
de: 'break' ist nur innerhalb von Schleifen und dem switch-Statement gültig
fr_fr: break ne peut pas être utilisé à l'intérieur d'une boucle ou d'une instruction switch
pt_br: break só pode ser usado dentro de um loop ou switch
sv_se: break kan enbart vara inuti en loop eller switch

source: continue can only be used inside of a loop
de: continue ist nur innerhalb von Schleifen gültig
fr_fr: continue ne peut être utilisé qu'à l'intérieur d'une boucle
pt_br: continue só pode ser usado dentro de um loop
sv_se: continue kan enbart vara inuti en loop

source: lower case letters compared with toUpperCase
de: Kleinbuchstaben werden mit toUpperCase verglichen
pt_br: letras minúsculas comparadas com toUpperCase
