Repository: quick-lint/quick-lint-js
Catalog: po/*.po
Languages: de, fr_fr, pt_br, sv_se

source: generator function '*' belongs after keyword function
de: '*'-Zeichen für Generatorfunktionen wird nach dem function-Schlüsselwort erwartet
fr_fr: une fonction génératrice '*' figure après la fonction mot-clé
pt_br: '*' de uma função generator precisa ficar após a palavra-chave function

source: generator function '*' belongs before function name
de: '*'-Zeichen für Generatorfunktionen wird vor Funktionsnamen erwartet
fr_fr: une fonction génératrice '*' figure avant le nom de la fonction
pt_br: '*' de uma função generator precisa ficar antes do nome da função
sv_se: generatorfunktion '*' tillhör före funktionens namn

source: only one comma is allowed between or after generic parameters
pt_br: apenas uma vírgula é permitida entre ou após parâmetros genéricos

source: 'in' disallowed in C-style for loop initializer
de: Ungültiges 'in' innerhalb Initialisierung der C-ähnlichen for-Schleife
fr_fr: 'in' désactivé dans l'initialisation des boucles for de style C
pt_br: 'in' não é permitido em um inicializador de um for
sv_se: 'in' är otillåtet i C-stil for loop initierare

source: indexing requires an expression
de: Indizierung erfordert einen Ausdruck
fr_fr: l'indexation nécessite une expression
pt_br: indexar requer uma expressão
sv_se: indexering kräver ett uttryck

source: invalid expression left of assignment
de: Ungültiger Ausdruck linkerseits der Zuweisung
fr_fr: expression invalide à gauche de l'assignation
pt_br: expressão inválida no lado esquerdo da atribuição
sv_se: ogiltigt uttryck före tilldelning

source: invalid hex escape sequence: {0}
de: Ungültige Hex-Escapesequenz: {0}
fr_fr: séquence d'échappement hex invalide: {0}
pt_br: sequência de escape hex inválida: {0}
sv_se: ogiltig kringående hex sekvens: {0}

source: invalid lone literal in object literal
de: Vereinzeltes Literal in Objekt-Literal
fr_fr: littéral isolé invalide dans un littéral objet
pt_br: valor sozinho é inválido em um objeto
sv_se: ogiltigt låneuttryck i objektliteral

source: invalid function parameter
de: Ungültiger Funktionsparameter
fr_fr: paramètre de fonction invalide
pt_br: parâmetro de função inválido
sv_se: ogiltig funktions parameter

source: '{0}' is not allowed for strings; use {1} instead
de: '{0}' ist für Strings nicht erlaubt. '{1}' anstattdessen verwenden.
pt_br: '{0}' não é permitido para strings; use {1}

source: '.' operator needs a key name; use + to concatenate strings; use [] to access with a dynamic key
de: Der '.'-Operator erfordert einen Schlüsselnamen; + verwenden, um Strings zu verketten; [] verwenden, um auf dynamische Schlüssel zuzugreifen
fr_fr: l'opérateur '.' nécessite un nom clé ; utiliser + pour concaténer des chaînes de caractères ; utiliser [] pour un accès avec une clé dynamique
pt_br: operador '.' requer o nome da chave; use + para concatenar strings; use [] para acessar com uma chave dinâmica
sv_se: '.' operation behöver nyckelords namn; använd + för att konkatenera sträng; använd [] för att komma åt med dynamisk nyckel

source: invalid UTF-8 sequence
de: Ungültige UTF-8 Sequenz
fr_fr: séquence UTF-8 invalide
pt_br: sequência UTF-8 inválida
sv_se: ogiltig UTF-8 sekvens

source: attribute has wrong capitalization; write '{1}' instead
de: Attribut mit falscher Groß- und Kleinschreibung; '{1}' anstattdessen schreiben
pt_br: atributo está com a capitalização errada; use '{1}'

source: misspelled React attribute; write '{1}' instead
de: React-Attribut ist falsch geschrieben; '{1}' anstattdessen schreiben
pt_br: erro de digitação no atributo de React; use '{1}'

source: event attributes must be camelCase: '{1}'
de: Event-Attribute müssen im camelCase geschrieben werden: '{1}'
pt_br: atributos de eventos precisam ser camelCase: '{1}'

source: React/JSX is not allowed in vanilla JavaScript code
pt_br: React/JSX não é permitido em código JavaScript vanilla

source: React/JSX is not allowed in TypeScript code
pt_br: React/JSX não é permitido em código TypeScript

source: keywords cannot contain escape sequences
de: Schlüsselworte dürfen keine Escapesequenzen beinhalten
fr_fr: les mots-clés ne peuvent pas contenir de séquence d'échappement
pt_br: palavras-chave não podem conter sequências de escape
sv_se: nyckelord kan inte innehålla en flyktsekvens

source: label named 'await' not allowed in async function
de: Labels namens 'await' sind innerhalb async-Functionen verboten
fr_fr: étiquette nommée 'await' non autorisée dans les fonctions async
pt_br: label chamada 'await' não é permitida em função async

source: legacy octal literal may not be BigInt
de: Veraltete Oktalliterale sind in BigInts nicht erlaubt
fr_fr: un littéral octal classique ne peut pas être de type BigInt
pt_br: número octal legado não pode ser BigInt
sv_se: ärftligt octal nummerlitteral kan inte vara BigInt

source: legacy octal literals may not contain underscores
de: Veraltete Oktalliterale dürfen keine Unterstriche enthalten
fr_fr: un littéral octal classique ne peut pas contenir de tiret de soulignement
pt_br: número octal legado não pode conter underscore
sv_se: ärftligt octal nummerlitteral kan inte innehålla understräck

source: {0} with no bindings
de: {0} ohne Binding
fr_fr: {0} sans liaisons
pt_br: {0} sem bindings
sv_se: {0} utan bindningar

source: a lexical declaration is not allowed as the body of {1:singular}
de: Eine lexikalische Deklaration ist nicht als Körper von {1:singular} erlaubt
fr_fr: une déclaration lexicale ne peut constituer le corps de {1:singular}
pt_br: uma declaração léxica não é permitida como o conteúdo de {1:singular}
sv_se: lexikaliskt deklaration är inte tillåtet inuti ett stycke av {1:singular}

source: functions/methods should not have '=>'
de: Funktionen/Methoden sollten kein '=>' haben
fr_fr: les fonctions/méthodes ne peuvent contenir '=>'
pt_br: funções/métodos não podem ter '=>'

source: methods should not use the 'function' keyword
de: Methoden sollten nicht mehr das 'function'-Schlüsselwort verwenden
fr_fr: les méthodes ne doivent pas utiliser le mot-clé 'function'
pt_br: métodos não podem usar a palavra-chave 'function'
sv_se: metoder bör inte använda nyckelordet 'function'

source: mismatched JSX tags; expected '</{1}>'
de: Unpassender JSX-Tag; '</{1}>' wurde anstattdessen erwartet
pt_br: tags JSX sem correspondência; esperado '</{1}>'

source: opening '<{1}>' tag here
de: Öffnender '<{1}>' Tag ist hier
pt_br: tag de abertura '<{1}>' aqui

source: missing end of array; expected ']'
de: Ende des Arrays fehlt. ']' erwartet
fr_fr: fin de tableau manquante ; ']' attendu
pt_br: falta o fim da array; esperado ']'
sv_se: saknar slut av lista; förväntades ']'

source: array started here
de: Array beginnt hier
fr_fr: tableau débuté ici
pt_br: array iniciou aqui
sv_se: lista startar här

source: missing arrow operator for arrow function
de: Arrow-Operator der Arrow-Funktion fehlt
fr_fr: opérateur de flèche manquant pour la fonction fléchée
pt_br: falta o arrow operator da arrow function

source: missing parameters for arrow function
de: Parameter fehlen für Arrow-Funktion
fr_fr: paramètres manquants pour la fonction fléchée
pt_br: faltam os parênteses da arrow function
sv_se: saknar parametrar före pilfunktion

source: missing body for catch clause
de: Körper des 'catch'-Blocks fehlt
fr_fr: corps manquant pour la clause catch
pt_br: falta o conteúdo da cláusula catch
sv_se: saknar stycke före catch sats

source: missing body for class
de: Klassenkörper fehlt
fr_fr: corps manquant pour la classe
pt_br: falta o conteúdo da classe
sv_se: saknar stycke för klass

source: missing body for do-while loop
de: Körper der do-while-Schleife fehlt
fr_fr: corps manquant pour la boucle do-while
pt_br: falta o conteúdo do loop do-while
sv_se: saknar stycke för do-while loop

source: missing body for finally clause
de: Körper des 'finally'-Blocks fehlt
fr_fr: corps manquant pour la clause finally
pt_br: falta o conteúdo da cláusula finally
sv_se: saknar stycke för finally sats

source: missing body for 'for' loop
de: Körper der for-Schleife fehlt
fr_fr: corps manquant pour la boucle 'for'
pt_br: falta o conteúdo do loop 'for'
sv_se: saknar stycke för 'for' loop

source: missing body for 'if' statement
de: Körper der if-Anweisung fehlt
fr_fr: corps manquant pour l'instruction 'if'
pt_br: falta o conteúdo da instrução 'if'
sv_se: saknar stycke för 'if' påstående

source: missing body for 'switch' statement
de: Körper des switch-Statements fehlt
fr_fr: corps manquant pour l'instruction 'switch'
pt_br: falta o conteúdo da instrução 'switch'
sv_se: saknar stycke för 'switch' påstående

source: missing body for try statement
de: Körper des try-Statements fehlt
fr_fr: corps manquant pour l'instruction try
pt_br: falta o conteúdo da instrução try
sv_se: saknar stycke för 'try' påstående

source: missing body for TypeScript interface
pt_br: falta o conteúdo da interface de TypeScript

source: missing body for while loop
de: Körper der while-Schleife fehlt
fr_fr: corps manquant pour la boucle while
pt_br: falta o conteúdo do loop while
sv_se: saknar stycke för while loop

source: missing catch or finally clause for try statement
de: catch- oder finally-Klausel des try-Statements fehlt
fr_fr: clause catch ou finally manquante pour l'instruction try
pt_br: falta a cláusula catch ou finally da instrução try
sv_se: saknar catch eller finally sats för try sats

source: try statement starts here
de: try-Statement beginnt hier
fr_fr: l'instruction try débute ici
pt_br: instrução try iniciou aqui
sv_se: try sats startar här

source: missing catch variable name between parentheses
de: catch-Variablenname fehlt zwischen Klammern
fr_fr: nom de variable de capture manquante entre les parenthèses
pt_br: falta o nome da variável entre parênteses
sv_se: saknar catch variabelnamn mellan paranteser

source: missing comma between object literal entries
de: Komma fehlt zwischen Feldern des Objekt-Literals
fr_fr: virgule manquante entre les entrées du littéral objet
pt_br: falta a vírgula entre as entradas do objeto
sv_se: saknar comma mellan förekommande objektliteral

source: missing comma between generic parameters
pt_br: falta a vírgula entre os parâmetros genéricos

source: missing ',' between variable declarations
de: Komma fehlt zwischen Variablendeklarationen
fr_fr: ',' manquant entre les déclarations de variable
pt_br: falta ',' entre declarações de variáveis
sv_se: saknar ',' mellan variabel deklaration

source: missing ':' in conditional expression
de: ':' des ternären Operators fehlt
fr_fr: ':' manquant dans l'expression conditionnelle
pt_br: falta ':' na expressão condicional
sv_se: saknar ':' i vilkorsuttryck

source: '?' creates a conditional expression
de: '?' erzeugt einen Ausdruck mit ternärem Operator
fr_fr: '?' créé une expression conditionnelle
pt_br: '?' cria uma expressão condicional
sv_se: '?' skapar vilkorsuttryck

source: missing condition for if statement
de: Bedingung der if-Anweisung fehlt
fr_fr: condition manquante pour l'instruction if
pt_br: falta a condição da instrução if
sv_se: saknar vilkor i if påstående

source: missing condition for while statement
de: Bedingung der while-Schleife fehlt
fr_fr: condition manquante pour l'instruction while
pt_br: falta a condição da instrução while
sv_se: saknar vilkor för while påstående

source: missing condition for switch statement
de: Bedingung des switch-Statements fehlt
fr_fr: condition manquante pour l'instruction switch
pt_br: falta a condição da instrução switch
sv_se: saknar vilkor för switch påstående

source: missing '...' in JSX attribute spread
de: '...' fehlt in JSX-Attribut-Spread
pt_br: falta o '...' para fazer o spread dos atributos no JSX

source: missing '=' after variable
de: '=' fehlt nach Variablenname
fr_fr: '=' manquant après une variable
pt_br: falta '=' após a variável
sv_se: saknar '=' efter variabel

source: missing expression between parentheses
de: Ausdruck fehlt zwischen Klammern
fr_fr: expression manquante entre parenthèses
pt_br: falta a expressão entre os parênteses
sv_se: saknar uttryck mellan paranteser

source: missing header and body for 'for' loop
de: Kopf und Körper der for-Schleife fehlen
fr_fr: en-tête et corps manquants pour la boucle 'for'
pt_br: falta o header e o conteúdo do loop 'for'
sv_se: saknar rubrik och stycke för 'for' loop

source: for loop needs an iterable, or condition and update clauses
de: for-Schleife erfordert entweder ein Iterable oder eine Bedingung und Updateanweisung
fr_fr: une boucle for nécessite un itérable ou des clauses de condition et de mise à jour
pt_br: loop for requer um iterável, ou uma condição e cláusulas de atualização
sv_se: for loop behöver en itererande eller vilkorligen uppdaterande moment

source: use 'while' instead to loop until a condition is false
de: 'while' benutzen, um zu iterieren, bis die Bedingung false wird
fr_fr: utiliser plutôt 'while' pour boucler jusqu'à ce qu'une condition soit fausse
pt_br: use 'while' para fazer um loop até a condição ser falsa
sv_se: använd 'while' istället för att iterera till vilkoren är falskt

source: missing function parameter list
de: Parameterliste der Funktion fehlt
fr_fr: liste de paramètres de fonction manquante
pt_br: falta a lista de parâmetros da função
sv_se: saknar funktions parameter lista

source: missing body for function
de: Körper der Funktion fehlt
fr_fr: corps manquant pour la fonction
pt_br: falta o conteúdo da função

source: missing for loop header
de: Kopf der Schleife fehlt
fr_fr: en-tête de boucle for manquante
pt_br: falta o header do for
sv_se: saknar for loop rubrik

source: missing initializer in const declaration
de: Initialisierung der const-Deklaration fehlt
fr_fr: initialisateur manquant dans la déclaration const
pt_br: falta o inicializador na declaração constante

source: unexpected expression; missing key for object entry
de: Ausdruck vor Zeilenumbruch erwartet
fr_fr: expression inattendue ; clé manquante pour l'entrée d'objet
pt_br: expressão inesperada; falta a chave para a entrada do objeto
sv_se: oförväntat uttryck; saknar nyckel för tillträdande objekt

source: missing name for class method
pt_br: falta o nome do método da classe

source: missing name in function statement
de: Name fehlt innerhalb function-Statement
fr_fr: nom manquant pour l'instruction de fonction
pt_br: falta o nome da função
sv_se: saknar namn för funktions påstående

source: missing name of class
de: Klassenname fehlt
fr_fr: nom de classe manquant
pt_br: falta o nome da classe
sv_se: saknar namn för klass

source: missing name of exported class
de: Name der exportierten Klasse fehlt
fr_fr: nom de classe exportée manquant
pt_br: falta o nome da classe exportada
sv_se: saknar namn för exporterad klass

source: missing name of exported function
de: Name der exportierten Funktion fehlt
fr_fr: nom de fonction exportée manquant
pt_br: falta o nome da função exportada
sv_se: saknar namn för exporterad funktion

source: missing name or parentheses for function
de: Name oder Klammern fehlen für die Funktion
fr_fr: nom ou parenthèses manquants pour la fonction
pt_br: falta o nome ou os parênteses da função
sv_se: saknar namn eller paranteser för funktion

source: missing operand for operator
de: Operand des Operators fehlt
fr_fr: opérande manquante pour l'opérateur
pt_br: falta o operando
sv_se: saknar operand för operatör

source: missing ',', ';', or newline between object type entries
pt_br: falta ',', ';' ou uma quebra de linha entre as entradas do tipo

source: redundant delete statement on variable
de: Unnötiges delete-Statement für Variable
fr_fr: instruction delete redondante pour la variable
pt_br: instrução delete na variável é redundante
sv_se: redundant delete påstående för variabel

source: missing 'if' after 'else'
pt_br: falta o 'if' após o 'else'

source: missing operator between expression and arrow function
de: Operator fehlt zwischen Ausdruck und Arrow-Funktion
fr_fr: opérateur manquant entre l'expression et la fonction fléchée
pt_br: falta o operador entre a expressão e a arrow function
sv_se: saknar operatör mellan uttryck och pilfunktion

source: missing parentheses around operand of '{0}'
de: Klammern fehlen um den Operanden von '{0}'
pt_br: faltam os parênteses ao redor do operando de '{0}'

source: '{0}' operator cannot be used before '**' without parentheses
de: Der Operator '{0}' kann nicht vor '**' ohne Klammern benutzt werden
pt_br: operador '{0}' não pode ser usado antes de '**' sem parênteses

source: missing parentheses around self-invoked function
de: Klammern um selbstaufgerufene Funktion fehlen
pt_br: faltam os parênteses em volta da função invocada

source: function starts here
de: Funktionsaufruf beginnt hier
pt_br: função inicia aqui

source: missing parentheses around left-hand side of '**'
de: Klammern um linke Seite von '**' fehlen
pt_br: faltam os parênteses ao redor do lado esquerdo do '**'

source: '**' operator cannot be used after unary '{1}' without parentheses
de: Ohne Klammern kann der Operator '**' nicht nach unärem '{1}' verwendet werden
pt_br: operador '**' não pode ser usado após unário '{1}' sem parênteses

source: missing property name after '.' operator
de: Eigenschaftsname fehlt nach dem '.'-Operator
fr_fr: nom de propriété manquant après l'opérateur '.'
pt_br: falta o nome da propriedade após o operador '.'
sv_se: saknar egenskaps namn efter '.' operatör

source: missing semicolon after abstract method
pt_br: falta o ponto e vírgula após o método abstrato

source: missing semicolon after statement
de: Semikolon fehlt nach Anweisung
fr_fr: point-virgule manquant après l'instruction
pt_br: falta o ponto e vírgula após a instrução
sv_se: saknar semikolon efter påstående

source: missing semicolon after field
pt_br: falta o ponto e vírgula após o campo

source: missing semicolon after index signature
pt_br: falta o ponto e vírgula no index signature

source: missing semicolon after interface method
pt_br: falta o ponto e vírgula após o método da interface

source: missing semicolon between condition and update parts of for loop
de: Semikolon fehlt zwischen Bedingung und Update-Anweisung der for-Schleife
fr_fr: point-virgule manquant entre la condition et l'actualisation de la boucle for
pt_br: falta o ponto e vírgula entre as partes da condição e da atualização do for
sv_se: saknar semikolon mellan vilkor och updaterings delen i for loopen

source: missing semicolon between init and condition parts of for loop
de: Semikolon fehlt zwischen Initialisierung und Bedingung der for-Schleife
fr_fr: point-virgule manquant entre l'initialisation et la condition de la boucle for
pt_br: falta o ponto e vírgula entre as partes da inicialização e da condição do for
sv_se: saknar semikolon mellan start och vilkors delen i for loopen

source: incomplete export; expected 'export default ...' or 'export {{name}' or 'export * from ...' or 'export class' or 'export function' or 'export let'
de: Unvollständiger Export. Möglichkeiten sind: 'export default ...' oder 'export {{name}' oder 'export * from ...' oder 'export class' oder 'export function' oder 'export let'
fr_fr: export incompl ; 'export default ...' ou 'export {{name}' ou 'export * from ...' ou 'export class' ou 'export function' ou 'export let' attendu
pt_br: export incompleto; esperado 'export default ...' ou 'export {{nome}' ou 'export * from ...' ou 'export class' ou 'export function' ou 'export let'
sv_se: ofullständig exportering; förväntades 'export default ...' eller 'export {{name}' eller 'export * from ...' eller 'export class' eller 'export function' eller 'export let'

source: missing type between '{1}' and '{0}'
pt_br: falta a tipagem entre '{1}' e '{0}'

source: missing TypeScript type
pt_br: falta o tipo de TypeScript

source: missing value for object property
de: Wert der Objekteigenschaft fehlt
fr_fr: valeur manquante pour la propriété d'objet
pt_br: falta o valor para a propriedade do objeto
sv_se: saknar värde för objektegenskap

source: missing variable name
de: Variablenname fehlt
fr_fr: nom de variable manquant
pt_br: falta o nome da variável
sv_se: saknar variabel namn

source: missing 'while (condition)' for do-while statement
de: 'while (condition)' der do-while-Schleife fehlt
fr_fr: 'while (condition)' manquant pour une instruction for do-while
pt_br: falta 'while (condição)' para a instrução do-while
sv_se: saknar 'while (vilkor)' till do-while påstående

source: do-while statement starts here
de: do-while-Schleife beginnt hier
fr_fr: instruction do-while débutée ici
pt_br: instrução do-while inicia aqui
sv_se: do-while påstående startar här

source: newline is not allowed between 'async' and arrow function parameter list
de: Zeilenumbruch ist zwischen 'async' und Arrow-Funktion verboten
fr_fr: un saut de ligne n'est pas autorisé entre 'async' et la liste de paramètres d'une fonction fléchée
pt_br: quebra de linha não é permitida entre 'async' e lista de parâmetros da arrow function
sv_se: nyrad är inte tillåten mellan 'async' och pilfunktions parameter lista

source: arrow is here
de: Arrow ist hier
fr_fr: la flèche est ici
pt_br: arrow está aqui
sv_se: pilen är här

source: newline is not allowed between 'async' and 'function'
pt_br: quebra de linha não é permitida entre 'async' e 'function'

source: 'function' is here
pt_br: 'function' está aqui

source: newline is not allowed after 'abstract'
pt_br: quebra de linha não é permitida após 'abstract'

source: newline is not allowed after 'interface'
pt_br: quebra de linha não é permitida após 'interface'

source: newline is not allowed after 'type'
pt_br: quebra de linha não é permitida após 'type'

source: newline is not allowed between field name and '!'
pt_br: quebra de linha não é permitida entre o nome do campo e o '!'

source: field declared here
pt_br: campo declaradoa qui

source: number literal contains consecutive underscores
de: Zahlenliteral darf keine aufeinanderfolgenden Unterstriche enthalten
fr_fr: le littéral numérique contient plusieurs tirets de soulignement consécutifs
pt_br: número contém underscores consecutivos
sv_se: numerlitterär innehåller upprepande understräck

source: number literal contains trailing underscore(s)
de: Zahlenliteral endet mit Unterstrich(en)
fr_fr: le littéral numérique est suivi d'un tiret de soulignement
pt_br: número contém underscore(s) no final
sv_se: nummerlitterär innehåller efterföljande understräck

source: octal literal may not have exponent
de: Oktalliterale mit Exponenten sind nicht erlaubt
fr_fr: un littéral octal ne peut avoir d'exposant
pt_br: número octal não pode ter expoente
sv_se: oktal nummerlitteräl kan inte ha exponent

source: octal literal may not have decimal
de: Oktalliterale mit Dezimalpunkt sind nicht erlaubt
fr_fr: un littéral octal ne peut avoir de partie décimale
pt_br: número octal não pode ter casa decimal
sv_se: oktal nummerlitteräl kan inte ha decimaler

source: use ':' instead of '=' in object literals
pt_br: use ':' em vez de '=' em objetos

source: TypeScript optional parameter requires parentheses
pt_br: parâmetros opcionais do TypeScript requerem parênteses

source: TypeScript optional parameter with type annotation requires parentheses
pt_br: parâmetros opcionais do TypeScript com anotação de tipo requerem parênteses

source: optional parameter cannot have both '?' and initializer; remove '?'
pt_br: parâmetro opcional não pode ter '?' e inicializador; remova o '?'

source: initializer starts here
pt_br: inicializador inicia aqui

source: integer cannot be represented and will be rounded to '{1}'
pt_br: inteiro não pode ser representado e vai ser arredondado para '{1}'

source: private properties are not allowed in object literals
de: Innerhalb von Objektliteralen sind private Eigenschaften verboten
fr_fr: les propriétés privées ne sont pas autorisées dans les littéraux objet
pt_br: propriedades privadas não são permitidas em objetos
sv_se: privata egenskaper är inte tillåtna i objektlitteräler
